#+TITLE:OS Agenda
#+AUTHOR:Marcus Birkenkrahe
#+SUBTITLE:Agenda OS420 Operating Systems CSC 420
#+STARTUP:overview hideblocks
#+OPTIONS: toc:nil num:nil ^:nil
#+PROPERTY: header-args:bash :exports both
#+PROPERTY: header-args:bash :results output
*** Hard links and ~inode~

    * A hard link creates an additional directory entry for a file

    * A hard link cannot leave its (physical) file system

    * A hard link is indistinguishable from the file itself

    * A file is made up of a *name* part and of a *content* part: when
      creating hard links, the system assigns a chain of disk blocks
      to an ~inode~, a unique number in the file system that you can
      see with the listing command ~ls -i~

      #+name: inode
      #+begin_src bash
        ls -i *.org
      #+end_src

      #+RESULTS:
      : 388132 agenda.org
      : 389984 bash.org
      : 388137 bookmarks.org
      : 388142 diary.org
      : 388130 FAQ.org
      : 388201 notes.org
      : 388131 README.org
      : 388219 schedule.org
      : 388220 syllabus.org

**** Redirection

     * A string and a number are redirected from ~stdout~ to a file
       #+name: redirection
       #+begin_src bash
         echo "to be or not to be" > text1
         cat text1

       #+end_src

       #+RESULTS: redirection
       : to be or not to be

     * In the C code block, the number 100 is first redirected to the
       file ~input~, then it is used by Org-mode as a value to print
       out to ~stdout~.
       #+name: cmdline
       #+begin_src C :cmdline < input :main yes :include <stdio.h>
         
       #+end_src

